package io.soda1127.soldierletter.model

/**
 * 성분 코드
 */
internal enum class SoldierClass(val value: String) {
    예비군인_훈련병("0000490001"),
    병사("0000490002"),
    장교("0000490003"),
    부사관("0000490004"),
    군무원("0000490005"),
}

/**
 * 군종 코드
 */
internal enum class SoldierGroup(val value: String) {
    육군("0000010001"),
    해군("0000010002"),
    공군("0000010003"),
    해병대("0000010004"),
}

/**
 * 입영부대 코드
 */
internal enum class SoldierUnit(val value: String) {
    사단_1("20121290100"),
    사단_2("20121490100"),
    사단_3("20121590100"),
    사단_5("20121690200"),
    사단_6("20121590200"),
    사단_7("20121390100"),
    사단_9("20121290200"),
    사단_11("20121790300"),
    사단_12("20121490200"),
    사단_15("20121390200"),
    사단_17("20121190100"),
    사단_20("20121790400"),
    사단_21("20121490300"),
    사단_22("20121890100"),
    사단_23("20121890200"),
    사단_25("20121290300"),
    사단_27("20121390300"),
    사단_28("20121690100"),
    사단_30("20121290400"),
    사단_31("20220280100"),
    사단_32("20220280200"),
    사단_35("20220280300"),
    사단_36("20120180100"),
    사단_37("20220280400"),
    사단_39("20220280500"),
    사단_50("20220280600"),
    사단_51("20121190200"),
    사단_53("20220280700"),
    육군훈련소("20020191700"),
    육군훈련소_23연대("20020191800"),
    육군훈련소_25연대("20020191900"),
    육군훈련소_26연대("20020192000"),
    육군훈련소_27연대("20020192100"),
    육군훈련소_28연대("20020192200"),
    육군훈련소_29연대("20020192300"),
    육군훈련소_30연대("20020192400"),
}

/**
 * 관계 코드
 */
internal enum class SoldierRelationship(val value: String) {
    PARENT("0000420001"), // 부모
    SPOUSE("0000420003"), // 배우자
    SIBLING("0000420002"), // 형제/자매
    FRIEND("0000420006"), // 친구/지인
    LOVER("0000420005"), // 애인
    RELATIVE("0000420004"), // 친척
    FAN("0000420007"), // 팬
}

/**
 * 군인 정보
 * @class Soldier
 */
internal data class Soldier(
    val missSoldierClassCdNm: SoldierClass, // 성분
    val grpCdNm: SoldierGroup, // 군종
    val traineeNm: String, // 이름
    val birth: String, // 생년월일 (YYYYMMDD)
    val regDate: String, // 입열 날짜 (YYYYMMDD)
    val soldierUnitCdNm: SoldierUnit, // 입영부대
    val traineeMgrSeq: String? = null // 훈련병 식별 코드
)